Q1. List any five functions of the pandas library with execution.

In [6]:
import pandas as pd

In [11]:
df = pd.read_csv('titanic.csv')

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [14]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [34]:


# Example usage:
data = pd.DataFrame({
    'A': [10, 20, 30],
    'B': [40, 50, 60],
    'C': [70, 80, 90]
})

In [35]:
df = pd.DataFrame(data)

In [36]:
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [42]:
len(df)

3

In [40]:
df.index = range(1,1+2*len(df),2)

In [41]:
df

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [44]:
data1 = pd.DataFrame({'Values' : [10,20,30,40,50]})

In [46]:
df = pd.DataFrame(data1)

In [47]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [48]:
def sum(df):
    if 'Values' in df.columns and len(df['Values'] >= 3):
        total = df['Values'].iloc[0] + df['Values'].iloc[1] + df['Values'].iloc[2]
        print(f"The sum is : {total}")
sum(df)

The sum is : 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [51]:
data2 = pd.DataFrame({'Text' : ["Hello World","Python","Pandas"]})

In [53]:
df = pd.DataFrame(data2)

In [54]:
data2

          Text
0  Hello World
1       Python
2       Pandas

In [56]:
def word_count(data2):
    df['count'] = df['Text'].apply(lambda x : len(str(x).split()))
    return df

df = word_count(df)

In [57]:
df

          Text  count
0  Hello World      2
1       Python      1
2       Pandas      1

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() -> returns the total number of datapoints in the DataFrame
DataFrame.shape() -> returns a tuple representing the structure of the DataFrame in terms of rows and columns

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel("file_name")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [62]:
data3 = pd.DataFrame({'Email' : ["a@gmail.com","b@gmail.com","c@gmail.com","d@gmail.com"]})

In [63]:
df = pd.DataFrame(data3)

In [64]:
df

         Email
0  a@gmail.com
1  b@gmail.com
2  c@gmail.com
3  d@gmail.com

In [65]:
def fun(df):
    df['Username'] = df['Email'].apply(lambda x : x.split('@')[0])
    return df
fun(df)
df

         Email Username
0  a@gmail.com        a
1  b@gmail.com        b
2  c@gmail.com        c
3  d@gmail.com        d

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10.

In [66]:
data = {
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
}

# Create the DataFrame
df = pd.DataFrame(data)

In [67]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [68]:
df[(df['A'] > 5) & (df['C'] < 10 )]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [69]:
#Q10
import pandas as pd

def add_moving_average(df):
    # Ensure the 'Date' column is in datetime format and sort the DataFrame by date
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values('Date')
    
    # Calculate the moving average with a window of 7 days
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

# Example usage:
data = {
    'Date': [
        '2024-01-01',
        '2024-01-02',
        '2024-01-03',
        '2024-01-04',
        '2024-01-05',
        '2024-01-06',
        '2024-01-07',
        '2024-01-08',
        '2024-01-09',
        '2024-01-10'
    ],
    'Sales': [100, 150, 200, 250, 300, 350, 400, 450, 500, 550]
}
df = pd.DataFrame(data)

# Add the Moving Average column
df = add_moving_average(df)

# Display the updated DataFrame
print(df)

        Date  Sales  MovingAverage
0 2024-01-01    100          100.0
1 2024-01-02    150          125.0
2 2024-01-03    200          150.0
3 2024-01-04    250          175.0
4 2024-01-05    300          200.0
5 2024-01-06    350          225.0
6 2024-01-07    400          250.0
7 2024-01-08    450          300.0
8 2024-01-09    500          350.0
9 2024-01-10    550          400.0